; domain
;  (c) 2001 Copyright (c) University of Huddersfield
;  Automatically produced from GIPO from the domain hiking
;  All rights reserved. Use of this software is permitted for non-commercial
;  research purposes, and it may be copied only for that use.  All copies must
;  include this copyright message.  This software is made available AS IS, and
;  neither the GIPO team nor the University of Huddersfield make any warranty about
;  the software or its performance.

(define (domain hiking)
  (:requirements :strips :equality :typing)
  (:types car tent person couple place )
  (:predicates 
              (at-tent ?o1 - tent ?o2 - place)
              (at-person ?o1 - person ?o2 - place)
              (at-car ?o1 - car ?o2 - place)
              (partners ?o1 - couple ?o2 - person ?o3 - person)
              (up ?o1 - tent)
              (down ?o1 - tent)
              (walked ?o1 - couple ?o2 - place)
              (next ?o1 - place ?o2 - place)
)

  (:action put-down
         :parameters ( ?o1 - person ?o2 - place ?o3 - tent)
         :precondition (and (at-person ?o1 ?o2)(at-tent ?o3 ?o2)(up ?o3))
         :effect (and (down ?o3)(not (up ?o3))))
	 
  (:action put-up
         :parameters ( ?o1 - person ?o2 - place ?o3 - tent)
         :precondition (and (at-person ?o1 ?o2)(at-tent ?o3 ?o2)(down ?o3))
         :effect (and (up ?o3)(not (down ?o3))))
	 
  (:action drive-passenger
         :parameters ( ?o1 - person ?o2 - place ?o3 - place ?o4 - car ?o5 - person)
         :precondition (and (at-person ?o1 ?o2)(at-car ?o4 ?o2)(at-person ?o5 ?o2)(not (= ?o1 ?o5)))
         :effect (and (at-person ?o1 ?o3)(not (at-person ?o1 ?o2))(at-car ?o4 ?o3)(not (at-car ?o4 ?o2))(at-person ?o5 ?o3)(not (at-person ?o5 ?o2))))

  (:action drive
         :parameters ( ?o1 - person ?o2 - place ?o3 - place ?o4 - car)
         :precondition (and (at-person ?o1 ?o2)(at-car ?o4 ?o2))
         :effect (and (at-person ?o1 ?o3)(not (at-person ?o1 ?o2))(at-car ?o4 ?o3)(not (at-car ?o4 ?o2))))
	 
  (:action drive-tent
         :parameters ( ?o1 - person ?o2 - place ?o3 - place ?o4 - car ?o5 - tent)
         :precondition (and (at-person ?o1 ?o2)(at-car ?o4 ?o2)(at-tent ?o5 ?o2)(down ?o5))
         :effect (and (at-person ?o1 ?o3)(not (at-person ?o1 ?o2))(at-car ?o4 ?o3)(not (at-car ?o4 ?o2))(at-tent ?o5 ?o3)(not (at-tent ?o5 ?o2))))
	 
  (:action drive-tent-passenger
         :parameters ( ?o1 - person ?o2 - place ?o3 - place ?o4 - car ?o5 - tent ?o6 - person)
         :precondition (and (at-person ?o1 ?o2)(at-car ?o4 ?o2)(at-tent ?o5 ?o2)(down ?o5)(at-person ?o6 ?o2)(not (= ?o1 ?o6)))
         :effect (and (at-person ?o1 ?o3)(not (at-person ?o1 ?o2))(at-car ?o4 ?o3)(not (at-car ?o4 ?o2))(at-tent ?o5 ?o3)(not (at-tent ?o5 ?o2))(at-person ?o6 ?o3)(not (at-person ?o6 ?o2))))

  (:action walk-together
         :parameters ( ?o1 - tent ?o2 - place ?o3 - person ?o4 - place ?o5 - person ?o6 - couple)
         :precondition (and (at-tent ?o1 ?o2)(up ?o1)(at-person ?o3 ?o4)(next ?o4 ?o2)(at-person ?o5 ?o4)(not (= ?o3 ?o5))(walked ?o6 ?o4)(partners ?o6 ?o3 ?o5))
         :effect (and (at-person ?o3 ?o2)(not (at-person ?o3 ?o4))(at-person ?o5 ?o2)(not (at-person ?o5 ?o4))(walked ?o6 ?o2)(not (walked ?o6 ?o4))))
)

; problem
(define (problem hiking-2-2)
  (:domain hiking)
  (:objects tent0 -  tent car1 -  car tent1 -  tent couple1 -  couple couple0 -  couple place0 -  place place1 -  place place2 -  place car0 -  car place3 -  place place4 -  place guy0 -  person girl0 -  person guy1 -  person girl1 -  person )
  (:init (next place1 place2) (next place2 place3) (partners couple0 guy0 girl0) (partners couple1 guy1 girl1) (next place0 place1) (next place3 place4) (at-tent tent1 place1) (walked couple0 place2) (at-tent tent0 place2) (at-person guy0 place2) (at-car car0 place2) (up tent0) (at-person guy1 place1) (at-person girl1 place1) (walked couple1 place1) (at-person girl0 place1) (at-car car1 place1) (down tent1) )
  (:goal (and (next place1 place2)(next place2 place3)(partners couple0 guy0 girl0)(partners couple1 guy1 girl1)(next place0 place1)(next place3 place4)(walked couple0 place2)(at-person guy0 place2)(walked couple1 place2)(down tent0)(at-person girl0 place4)(at-car car1 place4)(at-tent tent1 place4)(at-person guy1 place3)(at-car car0 place3)(at-tent tent0 place3)(at-person girl1 place3)(up tent1)(not (at-tent tent0 place0))(not (at-tent tent0 place1))(not (at-tent tent0 place2))(not (at-tent tent0 place4))(not (at-tent tent1 place0))(not (at-tent tent1 place1))(not (at-tent tent1 place2))(not (at-tent tent1 place3))(not (at-person guy0 place0))(not (at-person guy0 place1))(not (at-person guy0 place3))(not (at-person guy0 place4))(not (at-person girl0 place0))(not (at-person girl0 place1))(not (at-person girl0 place2))(not (at-person girl0 place3))(not (at-person guy1 place0))(not (at-person guy1 place1))(not (at-person guy1 place2))(not (at-person guy1 place4))(not (at-person girl1 place0))(not (at-person girl1 place1))(not (at-person girl1 place2))(not (at-person girl1 place4))(not (at-car car0 place0))(not (at-car car0 place1))(not (at-car car0 place2))(not (at-car car0 place4))(not (at-car car1 place0))(not (at-car car1 place1))(not (at-car car1 place2))(not (at-car car1 place3))(not (partners couple0 guy0 guy0))(not (partners couple0 guy0 guy1))(not (partners couple0 guy0 girl1))(not (partners couple0 girl0 guy0))(not (partners couple0 girl0 girl0))(not (partners couple0 girl0 guy1))(not (partners couple0 girl0 girl1))(not (partners couple0 guy1 guy0))(not (partners couple0 guy1 girl0))(not (partners couple0 guy1 guy1))(not (partners couple0 guy1 girl1))(not (partners couple0 girl1 guy0))(not (partners couple0 girl1 girl0))(not (partners couple0 girl1 guy1))(not (partners couple0 girl1 girl1))(not (partners couple1 guy0 guy0))(not (partners couple1 guy0 girl0))(not (partners couple1 guy0 guy1))(not (partners couple1 guy0 girl1))(not (partners couple1 girl0 guy0))(not (partners couple1 girl0 girl0))(not (partners couple1 girl0 guy1))(not (partners couple1 girl0 girl1))(not (partners couple1 guy1 guy0))(not (partners couple1 guy1 girl0))(not (partners couple1 guy1 guy1))(not (partners couple1 girl1 guy0))(not (partners couple1 girl1 girl0))(not (partners couple1 girl1 guy1))(not (partners couple1 girl1 girl1))(not (up tent0))(not (down tent1))(not (walked couple0 place0))(not (walked couple0 place1))(not (walked couple0 place3))(not (walked couple0 place4))(not (walked couple1 place0))(not (walked couple1 place1))(not (walked couple1 place3))(not (walked couple1 place4))(not (next place0 place0))(not (next place0 place2))(not (next place0 place3))(not (next place0 place4))(not (next place1 place0))(not (next place1 place1))(not (next place1 place3))(not (next place1 place4))(not (next place2 place0))(not (next place2 place1))(not (next place2 place2))(not (next place2 place4))(not (next place3 place0))(not (next place3 place1))(not (next place3 place2))(not (next place3 place3))(not (next place4 place0))(not (next place4 place1))(not (next place4 place2))(not (next place4 place3))(not (next place4 place4)))))

; plan
1. (walk-together tent0 place2 guy1 place1 girl1 couple1)
   deleted: (at-person guy1 place1) (at-person girl1 place1) (walked couple1 place1)
   added: (at-person guy1 place2) (at-person girl1 place2) (walked couple1 place2)
   goals met: 93 of 111
2. (put-down guy0 place2 tent0)
   deleted: (up tent0)
   added: (down tent0)
   goals met: 95 of 111
3. (drive-tent girl0 place1 place4 car1 tent1)
   deleted: (at-person girl0 place1) (at-car car1 place1) (at-tent tent1 place1)
   added: (at-person girl0 place4) (at-car car1 place4) (at-tent tent1 place4)
   goals met: 101 of 111
4. (drive-tent-passenger guy1 place2 place3 car0 tent0 girl1)
   deleted: (at-person guy1 place2) (at-car car0 place2) (at-tent tent0 place2) (at-person girl1 place2)
   added: (at-person guy1 place3) (at-car car0 place3) (at-tent tent0 place3) (at-person girl1 place3)
   goals met: 109 of 111
5. (put-up girl0 place4 tent1)
   deleted: (down tent1)
   added: (up tent1)
   goals met: 111 of 111
